{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing two features with related files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "JSON-style text containing prewritten summaries for multiple frontend files.",
  "frontend/index.css": "Tailwind base stylesheet defining extensive CSS variables for light and dark themes and applying global styles.",
  "frontend/index.html": "HTML entrypoint setting up root div and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping them with FoodPostsProvider.",
  "frontend/src/components/add-food/forms/AddFoodCardForm.tsx": "Single-page card form allowing users to submit a food donation with validation and navigation to the NGO Alert page.",
  "frontend/src/components/add-food/forms/AddFoodDrawerForm.tsx": "Drawer-based food submission form opened from a button, validating input and navigating to the NGO Alert page.",
  "frontend/src/components/add-food/forms/AddFoodWizardForm.tsx": "Two‑step wizard form for adding food donations with basic validation and navigation to the NGO Alert page.",
  "frontend/src/components/add-food/useAddFoodValidation.ts": "Validation hook checking required food form fields and storing error messages.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level layout wrapper with header, main content area, and bottom navigation.",
  "frontend/src/components/layout/BottomNav.tsx": "Renders a fixed bottom navigation bar with Home and History buttons, highlighting the active route.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are needed yet.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom eco-themed color variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AddFoodPage.tsx": "Displays tabbed interfaces for adding food via card, wizard, or drawer forms.",
  "frontend/src/pages/HistoryPage.tsx": "Shows previously added food posts from local state, with loading and empty states.",
  "frontend/src/pages/HomePage.tsx": "Home screen with an Add Food button and a placeholder map of nearby NGOs.",
  "frontend/src/pages/NgoAlertPage.tsx": "Displays an NGO alert with recent donation info, a route map, and navigation actions.",
  "frontend/src/pages/TrackPage.tsx": "Shows tracking details for the most recent food post, including donation info and status steps.",
  "frontend/src/state/FoodPostsProvider.tsx": "Ensures Zustand food post storage is rehydrated on app load.",
  "frontend/src/state/foodPostsStore.ts": "Zustand store for food posts with persistence, hydration state, and helper methods.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, containers, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state metadata including schema version, issues, and existing feature definitions for the Food Wastage UI."
}