{
  "backend/main.mo": "Implements Motoko canister logic for managing user profiles and food donation posts with access control and CRUD-style queries and mutations.",
  "backend/migration.mo": "Provides a no-op migration handler returning an empty state during upgrades.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing responsibilities of various frontend components, hooks, pages, and styles.",
  "frontend/index.css": "Defines global Tailwind layers and a custom OKLCH-based theme with light and dark mode CSS variables.",
  "frontend/index.html": "HTML entry point mounting the React app root and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router and defines routes for all main app pages wrapped in AppShell.",
  "frontend/src/components/add-food/forms/AddFoodCardForm.tsx": "Renders a card-style food donation form using validation and a createPost mutation before navigating to the NGO alert page.",
  "frontend/src/components/add-food/forms/AddFoodDrawerForm.tsx": "Implements a drawer-based food donation form with validation, createPost mutation, and navigation after submission.",
  "frontend/src/components/add-food/forms/AddFoodWizardForm.tsx": "Two-step food donation form that validates input and submits a new post using useCreatePost, then navigates to /ngo-alert.",
  "frontend/src/components/add-food/useAddFoodValidation.ts": "Provides simple form validation for food donation fields and returns error messages.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, footer, and routed content wrapped by BottomNav.",
  "frontend/src/components/layout/BottomNav.tsx": "Renders a fixed bottom navigation bar with buttons for Home and History that update based on current route.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls for creating posts and fetching user posts or tracking data using react-query.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom earth-toned color utilities for the app theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AddFoodPage.tsx": "Displays tabbed UI for selecting between card, wizard, or drawer variations of the add-food form.",
  "frontend/src/pages/HistoryPage.tsx": "Shows the user's past food posts with loading state and empty-state messaging.",
  "frontend/src/pages/HomePage.tsx": "Home screen showing a welcome message, an Add Food button, and a static map image of nearby NGOs.",
  "frontend/src/pages/NgoAlertPage.tsx": "Displays latest donation alert status with conditional loading, empty, or active states and navigation actions.",
  "frontend/src/pages/TrackPage.tsx": "Shows tracking details for the most recent donation with loading, empty, and detailed tracking views.",
  "frontend/src/state/FoodPostsProvider.tsx": "Empty file.",
  "frontend/src/state/foodPostsStore.ts": "Empty file.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, shadows, and plugins.",
  "project_state.json": "Tracks project metadata, existing features, new feature requests, and project configuration."
}