{
  "backend/main.mo": "Minimal Motoko canister actor with no functions.",
  "feature_evidence.json": "Feature evidence report mapping UI features to source files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose and behavior.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining light and dark theme color tokens and global styles.",
  "frontend/index.html": "HTML entry point defining root mount node and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with FoodPostsProvider.",
  "frontend/src/components/add-food/forms/AddFoodCardForm.tsx": "Single-page card form for adding food posts with validation and navigation to NGO Alert.",
  "frontend/src/components/add-food/forms/AddFoodDrawerForm.tsx": "Drawer-based form that opens from the bottom to input food details and submit posts.",
  "frontend/src/components/add-food/forms/AddFoodWizardForm.tsx": "Two-step wizard form for adding food with progress indicator and validation.",
  "frontend/src/components/add-food/useAddFoodValidation.ts": "Validation hook checking required fields for Add Food forms and returning error messages.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main layout with a header, content outlet, and bottom navigation.",
  "frontend/src/components/layout/BottomNav.tsx": "Renders a fixed bottom navigation bar with Home and History buttons highlighting the active route.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s Internet Identity, invalidating queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and helpers using Internet Identity, including login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are currently implemented.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines theme variables for colors, typography, and eco-green utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AddFoodPage.tsx": "Page with tabs allowing users to add food using card, wizard, or drawer forms.",
  "frontend/src/pages/HistoryPage.tsx": "Displays a list of food posts from the store or a placeholder when empty.",
  "frontend/src/pages/HomePage.tsx": "Home page offering quick navigation to add food and showing a placeholder map of nearby NGOs.",
  "frontend/src/pages/NgoAlertPage.tsx": "Shows an NGO alert with route map and the most recent food post, plus navigation options.",
  "frontend/src/state/FoodPostsProvider.tsx": "Simple provider wrapper for potential future food posts context.",
  "frontend/src/state/foodPostsStore.ts": "Zustand store managing food posts with add and most-recent retrieval functions.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, shadows, and animations with an eco-green palette.",
  "project_state.json": "Defines project metadata, required placeholder images, and a list of existing UI and theme features to implement for a responsive web version of the prototype. Contains no code, only structured project state and requirements."
}