{
  "kind": "build_request",
  "title": "Make the app a real value-based web app with backend persistence",
  "projectName": "Food Wastage UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a Motoko backend data model and API to persist food donation posts so the app is not purely client-side (support creating a post and listing posts for the current caller).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "real value based web"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo defines stable state to store food posts keyed by caller Principal (or equivalent per-user partitioning)",
        "Backend exposes methods to: create/add a food post, list food posts for the authenticated/anonymous caller, and fetch the most recent post",
        "Returned food posts include the fields the UI already uses (title, quantity, date, time, timestamp/id)",
        "Backend compiles and can be called from the generated frontend actor"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Wire the frontend to use the backend API (via the existing actor hook and React Query) for adding and reading food posts, so History, NGO Alert, and Track work after refresh and across devices.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "real value based web"
        ]
      },
      "acceptanceCriteria": [
        "Food submission flows (card/drawer/wizard) create a new post through the backend API and then navigate as they do today",
        "History page reads posts from the backend and renders the same UI states (loading, empty, populated) without relying on localStorage hydration",
        "NGO Alert and Track pages use backend data to resolve the 'most recent' donation, including after a hard refresh",
        "frontend/src/hooks/useQueries.ts is updated to contain React Query hooks for the backend methods (queries + mutation)"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the tracking view reflect real, backend-derived tracking status for the most recent donation instead of a hard-coded step list, so tracking works reliably in live/production.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "real value based web"
        ]
      },
      "acceptanceCriteria": [
        "Backend provides a method to fetch tracking status for the most recent post (or by post id) and returns an ordered list of steps with completion state (or an equivalent status representation)",
        "Track page renders tracking steps based on backend response and shows an appropriate empty state when no donation exists",
        "If backend cannot find tracking data for a post, the UI shows a clear fallback state rather than showing hard-coded progress"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply a cohesive, distinct visual theme across the app (colors/typography/surfaces) to elevate perceived quality while keeping the existing information architecture and routes unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "real value based web"
        ]
      },
      "acceptanceCriteria": [
        "Theme is consistent across Home/Add Food/NGO Alert/History/Track screens (cards, buttons, headings, spacing)",
        "Do not introduce new product features; only visual/UX polish and consistency changes",
        "Avoid using a blue/purple primary palette unless explicitly requested"
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko logic in the single actor at backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths; compose those components instead.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is allowed).",
    "Adding external databases or off-chain storage services.",
    "Real-time tracking updates via websockets/push notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}