{
  "kind": "build_request",
  "title": "Fix live tracking flow and persist food posts so Track works in production",
  "projectName": "Food Wastage UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the 'Track' button on the NGO Alert screen perform a real action by navigating to a dedicated tracking view (new route) that displays the current pickup/tracking status for the most recent food post.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "track system is not working live"
        ]
      },
      "acceptanceCriteria": [
        "On /ngo-alert, clicking the 'Track' button navigates to a tracking view (e.g., /track) instead of doing nothing.",
        "The tracking view renders without errors in production builds and shows a clear status timeline/steps (e.g., 'Request received' -> 'Driver assigned' -> 'On the way' -> 'Arrived').",
        "If there is a most recent food post, the tracking view includes its title/quantity/date/time; if not, it shows an English empty-state message prompting the user to add a food post first and provides a button to navigate to Add Food."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Persist the client-side food posts store so that History, NGO Alert, and the new tracking view continue to work after a page refresh in the live/production environment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "track system is not working live"
        ]
      },
      "acceptanceCriteria": [
        "After posting a food item, refreshing the page keeps the item visible in the History screen.",
        "After posting a food item, refreshing the page keeps the most recent post available to the NGO Alert screen (mostRecent is not lost due to in-memory reset).",
        "Persistence uses browser storage only (no external database) and does not require backend changes."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Do not implement real GPS, live maps, or real-time vehicle location updates.",
    "Do not add third-party map integrations or external APIs.",
    "Do not add non-Internet-Computer authentication providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}