{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Track flow with tracking route and persistent food posts (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Track navigate to a dedicated tracking route that shows a clear status timeline and the most recent food post (or an empty state linking to Add Food).",
      "acceptanceCriteria": [
        "On /ngo-alert, clicking the 'Track' button navigates to a tracking view (e.g., /track) instead of doing nothing.",
        "The tracking view renders without errors in production builds and shows a clear status timeline/steps (e.g., 'Request received' -> 'Driver assigned' -> 'On the way' -> 'Arrived').",
        "If there is a most recent food post, the tracking view includes its title/quantity/date/time; if not, it shows an English empty-state message prompting the user to add a food post first and provides a button to navigate to Add Food"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TrackPage.tsx",
          "operation": "create",
          "description": "Create a new TrackPage that reads the most recent food post from the Zustand store and renders (1) a clear tracking status timeline UI and (2) either the most-recent post details (title/quantity/date/time) or an English empty state with a button that navigates to /add-food. Use shadcn-ui primitives already present in the app (e.g., Button/Card) for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new TanStack Router route for /track that renders TrackPage, and add it into the routeTree so it is reachable via navigation (prevents an orphaned page)."
        },
        {
          "path": "frontend/src/pages/NgoAlertPage.tsx",
          "operation": "modify",
          "description": "Wire the existing 'Track' button to navigate to /track on click, ensuring the button performs a real action in production builds. Continue using existing shadcn-ui Button; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Persist food posts in browser storage so History, NGO Alert mostRecent, and Track survive page refresh without backend changes.",
      "acceptanceCriteria": [
        "After posting a food item, refreshing the page keeps the item visible in the History screen.",
        "After posting a food item, refreshing the page keeps the most recent post available to the NGO Alert screen (mostRecent is not lost due to in-memory reset).",
        "Persistence uses browser storage only (no external database) and does not require backend changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/state/foodPostsStore.ts",
          "operation": "modify",
          "description": "Add browser-storage persistence to the Zustand food posts store (e.g., localStorage-backed persist middleware) so posts rehydrate after refresh in production. Ensure getMostRecent continues to work based on the persisted posts array."
        },
        {
          "path": "frontend/src/state/FoodPostsProvider.tsx",
          "operation": "modify",
          "description": "Update FoodPostsProvider to ensure the persisted store is rehydrated on app load (and optionally expose a simple 'hydrated' guard if needed to avoid transient empty state flashes), without introducing backend dependencies."
        },
        {
          "path": "frontend/src/pages/HistoryPage.tsx",
          "operation": "modify",
          "description": "Adjust HistoryPage to remain compatible with persisted/rehydrated state (and any optional hydration guard), so a refresh still shows previously posted items. Continue using existing shadcn-ui Card components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/NgoAlertPage.tsx",
          "operation": "modify",
          "description": "Ensure NGO Alert continues to derive mostRecent from the persisted store after refresh (and any optional hydration guard), so the most recent post is not lost in production."
        }
      ]
    }
  ]
}