{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Food Wastage UI — Persisted posts, backend-powered tracking, cohesive theme",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Replace client-only food post storage with backend-powered React Query hooks for create + list, and wire Add Food/History/NGO Alert/Track to use persisted data.",
      "acceptanceCriteria": [
        "Food submission flows (card/drawer/wizard) create a new post through the backend API and then navigate as they do today",
        "History page reads posts from the backend and renders the same UI states (loading, empty, populated) without relying on localStorage hydration",
        "NGO Alert and Track pages use backend data to resolve the 'most recent' donation, including after a hard refresh",
        "frontend/src/hooks/useQueries.ts is updated to contain React Query hooks for the backend methods (queries + mutation)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement React Query hooks backed by the actor from useActor (from the core-infrastructure component) for creating a post and reading posts (e.g., create mutation, my-posts query, and a derived 'most recent post' query). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/add-food/forms/AddFoodCardForm.tsx",
          "operation": "modify",
          "description": "Switch submission from Zustand/localStorage to the backend createPost mutation hook (React Query), mapping existing form fields to the backend-required fields and keeping the current navigation behavior. Use existing shadcn-ui form primitives already imported; compose them only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/add-food/forms/AddFoodDrawerForm.tsx",
          "operation": "modify",
          "description": "Switch drawer form submission from Zustand/localStorage to the backend createPost mutation hook (React Query), keeping close + navigation behavior the same and showing basic submitting/error states in English. Use existing shadcn-ui components already imported; compose them only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/add-food/forms/AddFoodWizardForm.tsx",
          "operation": "modify",
          "description": "Switch wizard submission from Zustand/localStorage to the backend createPost mutation hook (React Query), preserving step flow and navigation, and adding basic submitting/error states in English. Use existing shadcn-ui components already imported; compose them only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HistoryPage.tsx",
          "operation": "modify",
          "description": "Replace Zustand hydration-based rendering with a backend-driven posts query (React Query) and keep the same loading/empty/populated UI states using the persisted data. Use existing shadcn-ui Card components already imported; compose them only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/NgoAlertPage.tsx",
          "operation": "modify",
          "description": "Replace Zustand 'most recent' lookup with a backend-driven 'most recent post' query and ensure the page still renders meaningful content after refresh (including a clear empty state when there is no donation). Use existing shadcn-ui components already imported; compose them only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TrackPage.tsx",
          "operation": "modify",
          "description": "Stop relying on Zustand hydration for the donation being tracked; read the most recent donation via backend-driven query hooks so the page works across refresh and devices. Use existing shadcn-ui components already imported; compose them only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove dependency on FoodPostsProvider (localStorage rehydration) now that posts are backend-persisted, keeping the existing routes unchanged. Verify the core-infrastructure component's guidance for actor/query invalidation patterns before implementing."
        },
        {
          "path": "frontend/src/state/FoodPostsProvider.tsx",
          "operation": "delete",
          "description": "Delete the localStorage hydration provider since post persistence is handled via backend + React Query (no client-side hydration gate should block History/Track rendering)."
        },
        {
          "path": "frontend/src/state/foodPostsStore.ts",
          "operation": "delete",
          "description": "Delete the persisted Zustand store used for food posts to ensure the app no longer relies on localStorage for History/NGO Alert/Track."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Render tracking steps from backend-derived tracking status for the most recent donation, including clear empty/fallback states.",
      "acceptanceCriteria": [
        "Backend provides a method to fetch tracking status for the most recent post (or by post id) and returns an ordered list of steps with completion state (or an equivalent status representation)",
        "Track page renders tracking steps based on backend response and shows an appropriate empty state when no donation exists",
        "If backend cannot find tracking data for a post, the UI shows a clear fallback state rather than showing hard-coded progress"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/extend a React Query hook for backend tracking (e.g., getCurrentTracking) and expose a UI-friendly model (ordered steps) plus error/empty handling. Use the existing actor from useActor (core-infrastructure) and React Query patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TrackPage.tsx",
          "operation": "modify",
          "description": "Replace the hard-coded trackingSteps array with rendering driven by the backend tracking query response; show (1) empty donation state when no recent post exists and (2) explicit fallback state when tracking data is missing/unavailable, all in English. Use existing shadcn-ui Cards/Buttons already imported; compose them only. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Apply a cohesive, distinct eco-themed visual system across all existing screens without changing routes or adding features.",
      "acceptanceCriteria": [
        "Theme is consistent across Home/Add Food/NGO Alert/History/Track screens (cards, buttons, headings, spacing)",
        "Do not introduce new product features; only visual/UX polish and consistency changes",
        "Avoid using a blue/purple primary palette unless explicitly requested"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Refine the global theme tokens (CSS variables) to strengthen a cohesive eco/earth palette (no blue/purple primary), and ensure base typography/surfaces feel consistent across pages. This should align with shadcn-ui theming expectations; verify the shadcn-ui component usage instructions before implementing."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Align Tailwind theme extensions with the refined design tokens (colors/shadows/radius) so all screens can use consistent utility patterns while keeping the existing information architecture intact."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Polish global layout styling (header surface, spacing, container, background) to match the theme tokens and improve perceived quality while keeping structure and routes unchanged. Verify shadcn-ui composition guidance before implementing."
        },
        {
          "path": "frontend/src/components/layout/BottomNav.tsx",
          "operation": "modify",
          "description": "Update bottom navigation styling to match the cohesive theme (surfaces, borders, active state, typography) without changing navigation targets. Verify shadcn-ui composition guidance before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Apply consistent page-level typography, spacing, and card/button surfaces to match the refined theme (no new features/routes). Verify shadcn-ui composition guidance before implementing."
        },
        {
          "path": "frontend/src/pages/AddFoodPage.tsx",
          "operation": "modify",
          "description": "Ensure tabs/header spacing/typography align with the cohesive theme across the Add Food screen (no new flows). Verify shadcn-ui composition guidance before implementing."
        },
        {
          "path": "frontend/src/components/add-food/forms/AddFoodCardForm.tsx",
          "operation": "modify",
          "description": "Polish card form visuals (card surface, input spacing, button consistency) to match theme tokens while preserving current validation and UX. Verify shadcn-ui composition guidance before implementing."
        },
        {
          "path": "frontend/src/components/add-food/forms/AddFoodDrawerForm.tsx",
          "operation": "modify",
          "description": "Polish drawer form visuals (sheet content spacing, typography, button styling consistency) to match theme tokens while preserving current UX. Verify shadcn-ui composition guidance before implementing."
        },
        {
          "path": "frontend/src/components/add-food/forms/AddFoodWizardForm.tsx",
          "operation": "modify",
          "description": "Polish wizard visuals (step indicator, spacing, card surface, buttons) to match theme tokens while preserving current UX. Verify shadcn-ui composition guidance before implementing."
        },
        {
          "path": "frontend/src/pages/HistoryPage.tsx",
          "operation": "modify",
          "description": "Unify History page visual hierarchy (title, empty/loading states, card density) with the app theme while keeping the same page content and route. Verify shadcn-ui composition guidance before implementing."
        },
        {
          "path": "frontend/src/pages/NgoAlertPage.tsx",
          "operation": "modify",
          "description": "Unify NGO Alert page surfaces and typography (alert panel, map card, buttons) to match theme tokens while keeping existing information architecture and route. Verify shadcn-ui composition guidance before implementing."
        },
        {
          "path": "frontend/src/pages/TrackPage.tsx",
          "operation": "modify",
          "description": "Unify Track page styling (details card, tracking card, empty/fallback states, buttons) to match theme tokens while keeping existing information architecture and route. Verify shadcn-ui composition guidance before implementing."
        }
      ]
    }
  ]
}